Masmiseim36/nxpSDK/devices/MKW38A4/MKW38A4.h
/** XCVR_2P4GHZ_PHY - Register Layout Typedef */
typedef struct {
  __IO uint32_t FSK_PD_CFG0;                       /**< PHY Uncoded Preamble Detect Config 0, offset: 0x0 */
  __IO uint32_t FSK_PD_CFG1;                       /**< PHY Uncoded Preamble Detect Config 1, offset: 0x4 */
  __IO uint32_t FSK_PD_CFG2;                       /**< PHY Uncoded Preamble Detect Config 2, offset: 0x8 */
  __IO uint32_t FSK_PD_PH[2];                      /**< , array offset: 0xC, array step: 0x4 */
  __I  uint32_t FSK_PD_RO_PH[4];                   /**< , array offset: 0x14, array step: 0x4 */
  __IO uint32_t FSK_CFG0;                          /**< PHY Uncoded Config 0, offset: 0x24 */
  __IO uint32_t FSK_CFG1;                          /**< PHY Uncoded Config 1, offset: 0x28 */
  __IO uint32_t FSK_CFG2;                          /**< PHY Uncoded Config 2, offset: 0x2C */
  __IO uint32_t FSK_CFG3;                          /**< PHY Uncoded Config 3, offset: 0x30 */
  __IO uint32_t FSK_PT;                            /**< PHY Uncoded Power Threshold Config, offset: 0x34 */
  __IO uint32_t FSK_FAD_CTRL;                      /**< PHY Uncoded FAD Control, offset: 0x38 */
  __IO uint32_t FSK_FAD_CFG;                       /**< PHY Uncoded FAD Config, offset: 0x3C */
  __I  uint32_t FSK_STAT;                          /**< PHY Uncoded Status, offset: 0x40 */
  __IO uint32_t LR_PD_CFG;                         /**< PHY Long Range Preamble Detect Config, offset: 0x44 */
  __IO uint32_t LR_PD_PH[4];                       /**< , array offset: 0x48, array step: 0x4 */
  __I  uint32_t LR_PD_RO_PH[13];                   /**< , array offset: 0x58, array step: 0x4 */
  __IO uint32_t LR_AA_CFG;                         /**< PHY Long Range AA Config, offset: 0x8C */
  __I  uint32_t LR_STAT;                           /**< PHY Long Range Status, offset: 0x90 */
  __IO uint32_t SM_CFG;                            /**< PHY State Machine Config, offset: 0x94 */
  __IO uint32_t MISC;                              /**< PHY Misc Config, offset: 0x98 */
  __I  uint32_t STAT0;                             /**< PHY Status 0, offset: 0x9C */
  __I  uint32_t STAT1;                             /**< PHY Status 1, offset: 0xA0 */
  __I  uint32_t STAT2;                             /**< PHY Status 2, offset: 0xA4 */
  __IO uint32_t PREPHY_MISC;                       /**< PHY PrePHY Misc Config, offset: 0xA8 */
  __IO uint32_t DMD_CTRL0;                         /**< PHY Demodulator Control 0, offset: 0xAC */
  __IO uint32_t DMD_CTRL1;                         /**< PHY Dmodulator Control 1, offset: 0xB0 */
  __IO uint32_t DMD_CTRL2;                         /**< PHY Demodulator Control 2, offset: 0xB4 */
  struct {                                         /* offset: 0xB8, array step: 0xC */
    __IO uint32_t DMD_WAVE_REG0;                     /**< , array offset: 0xB8, array step: 0xC */
    __IO uint32_t DMD_WAVE_REG1;                     /**< , array offset: 0xBC, array step: 0xC */
    __IO uint32_t DMD_WAVE_REG2;                     /**< , array offset: 0xC0, array step: 0xC */
  } DEMOD_WAVE[8];
} XCVR_2P4GHZ_PHY_Type;

/* ----------------------------------------------------------------------------
   -- XCVR_2P4GHZ_PHY Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_2P4GHZ_PHY_Register_Masks XCVR_2P4GHZ_PHY Register Masks
 * @{
 */

/*! @name FSK_PD_CFG0 - PHY Uncoded Preamble Detect Config 0 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PREAMBLE_T_SCALE_MASK (0xFU)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PREAMBLE_T_SCALE_SHIFT (0U)
/*! PREAMBLE_T_SCALE - Scaling factor used for fractional time estimation during preamble search.
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PREAMBLE_T_SCALE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PREAMBLE_T_SCALE_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PREAMBLE_T_SCALE_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PD_IIR_ALPHA_MASK (0xFF00U)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PD_IIR_ALPHA_SHIFT (8U)
/*! PD_IIR_ALPHA - Forgetting factor used by the complex correlations smoothing leaky integrator.
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PD_IIR_ALPHA(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PD_IIR_ALPHA_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_CFG0_PD_IIR_ALPHA_MASK)
/*! @} */

/*! @name FSK_PD_CFG1 - PHY Uncoded Preamble Detect Config 1 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG1_PREAMBLE_PATTERN_MASK (0xFFU)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG1_PREAMBLE_PATTERN_SHIFT (0U)
/*! PREAMBLE_PATTERN - 8-bit preamble pattern used in FM-domain preamble detector.
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG1_PREAMBLE_PATTERN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_CFG1_PREAMBLE_PATTERN_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_CFG1_PREAMBLE_PATTERN_MASK)
/*! @} */

/*! @name FSK_PD_CFG2 - PHY Uncoded Preamble Detect Config 2 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_1M_MASK (0xFFU)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_1M_SHIFT (0U)
/*! PD_THRESH_ACQ_1_3_1M - Preamble detect threshold for acq mode 1 and 3 at data rate 1Mbps
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_1M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_1M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_1M_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_2M_MASK (0xFF0000U)
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_2M_SHIFT (16U)
/*! PD_THRESH_ACQ_1_3_2M - Preamble detect threshold for acq mode 1 and 3 at data rate 2Mbps
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_2M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_2M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_CFG2_PD_THRESH_ACQ_1_3_2M_MASK)
/*! @} */

/*! @name FSK_PD_PH -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF0_MASK      (0x3FU)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF0_SHIFT     (0U)
/*! ref0 - Uncoded preamble reference waveform sample 4 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF0(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_PH_REF0_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_PH_REF0_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF1_MASK      (0x3F00U)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF1_SHIFT     (8U)
/*! ref1 - Uncoded preamble reference waveform sample 5 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF1(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_PH_REF1_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_PH_REF1_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF2_MASK      (0x3F0000U)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF2_SHIFT     (16U)
/*! ref2 - Uncoded preamble reference waveform sample 6 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF2(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_PH_REF2_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_PH_REF2_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF3_MASK      (0x3F000000U)
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF3_SHIFT     (24U)
/*! ref3 - Uncoded preamble reference waveform sample 7 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_REF3(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_PH_REF3_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_PH_REF3_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_FSK_PD_PH */
#define XCVR_2P4GHZ_PHY_FSK_PD_PH_COUNT          (2U)

/*! @name FSK_PD_RO_PH -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF0_MASK   (0x3FU)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF0_SHIFT  (0U)
/*! ref0 - Uncoded preamble reference waveform sample 28 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF0(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF0_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF0_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF1_MASK   (0x3F00U)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF1_SHIFT  (8U)
/*! ref1 - Uncoded preamble reference waveform sample 29 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF1(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF1_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF1_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF2_MASK   (0x3F0000U)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF2_SHIFT  (16U)
/*! ref2 - Uncoded preamble reference waveform sample 30 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF2(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF2_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF2_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF3_MASK   (0x3F000000U)
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF3_SHIFT  (24U)
/*! ref3 - Uncoded preamble reference waveform sample 31 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF3(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF3_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_REF3_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_FSK_PD_RO_PH */
#define XCVR_2P4GHZ_PHY_FSK_PD_RO_PH_COUNT       (4U)

/*! @name FSK_CFG0 - PHY Uncoded Config 0 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_OUT_SEL_MASK (0x2U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_OUT_SEL_SHIFT (1U)
/*! AA_OUT_SEL - Specifies which AA bits to be played-back to the LL:
 *  0b0..output the received AA bits
 *  0b1..output the programmed AA bits
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_OUT_SEL(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_AA_OUT_SEL_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_AA_OUT_SEL_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_FSK_BIT_INVERT_MASK (0x4U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_FSK_BIT_INVERT_SHIFT (2U)
/*! FSK_BIT_INVERT - This applies at the demodulator, so it affects both AA and the data portions of the packet.
 *  0b0..Normal demodulation
 *  0b1..Invert demodulated bits
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_FSK_BIT_INVERT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_FSK_BIT_INVERT_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_FSK_BIT_INVERT_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_HAM_CHK_LOW_PWR_MASK (0x10U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_HAM_CHK_LOW_PWR_SHIFT (4U)
/*! HAM_CHK_LOW_PWR - Indicates whether hamming-distance check is applied at signal levels below mag_thresh_high;
 *  0b0..no
 *  0b1..yes
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_HAM_CHK_LOW_PWR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_HAM_CHK_LOW_PWR_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_HAM_CHK_LOW_PWR_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_MSK_EN_MASK     (0x20U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_MSK_EN_SHIFT    (5U)
/*! MSK_EN - Configures PHY for MSK decoding.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_MSK_EN(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_MSK_EN_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_MSK_EN_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_MSK2FSK_SEED_MASK (0x40U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_MSK2FSK_SEED_SHIFT (6U)
/*! MSK2FSK_SEED - Last bit of preamble.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_MSK2FSK_SEED(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_MSK2FSK_SEED_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_MSK2FSK_SEED_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_1M_MASK (0x1F00U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_1M_SHIFT (8U)
/*! AA_ACQ_1_2_3_THRESH_1M - For 1Mbps data rate, Correlation threshold applicable to AA detection; uses ufix5_En5 fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_1M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_1M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_1M_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_BLE_NTW_ADR_THR_MASK (0x700000U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_BLE_NTW_ADR_THR_SHIFT (20U)
/*! BLE_NTW_ADR_THR - Maximum hamming distance from the given AA pattern that may still be accepted as a match; valid range [0,7].
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_BLE_NTW_ADR_THR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_BLE_NTW_ADR_THR_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_BLE_NTW_ADR_THR_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_2M_MASK (0x1F000000U)
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_2M_SHIFT (24U)
/*! AA_ACQ_1_2_3_THRESH_2M - For 2Mbps data rate, correlation threshold applicable to AA detection; uses ufix5_En5 fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_2M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_2M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG0_AA_ACQ_1_2_3_THRESH_2M_MASK)
/*! @} */

/*! @name FSK_CFG1 - PHY Uncoded Config 1 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_MASK      (0x7FFU)
#define XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_SHIFT     (0U)
/*! OVERH - Modulation index; represented in ufix11_En7 format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_INV_MASK  (0xFF800U)
#define XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_INV_SHIFT (11U)
/*! OVERH_INV - Reciprocal of modulation index; represented in ufix9_En7 format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_INV(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_INV_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG1_OVERH_INV_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG1_SYNCTSCALE_MASK (0xF000000U)
#define XCVR_2P4GHZ_PHY_FSK_CFG1_SYNCTSCALE_SHIFT (24U)
/*! SYNCTSCALE - Scaling factor used for fractional time estimation during AA search; represented in ufix4_En3 format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG1_SYNCTSCALE(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG1_SYNCTSCALE_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG1_SYNCTSCALE_MASK)
/*! @} */

/*! @name FSK_CFG2 - PHY Uncoded Config 2 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_1M_MASK (0xFFFU)
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_1M_SHIFT (0U)
/*! MAG_THRESH_1M - For 1Mbps data rate, the lowest signal level below which synchronization is
 *    considered unreliable and hence disallowed; uses ufix12_En24 fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_1M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_1M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_1M_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_HI_1M_MASK (0xFFF0000U)
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_HI_1M_SHIFT (16U)
/*! MAG_THRESH_HI_1M - For 1Mbps data rate, the lowest signal level above which hamming-distance is
 *    always checked during AA detection; uses ufix12_En24 fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_HI_1M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_HI_1M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_THRESH_HI_1M_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_WIN_MASK    (0xF0000000U)
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_WIN_SHIFT   (28U)
/*! MAG_WIN - Indicates the forgetting factor used in received signal level measurement;
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_WIN(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_WIN_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG2_MAG_WIN_MASK)
/*! @} */

/*! @name FSK_CFG3 - PHY Uncoded Config 3 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_2M_MASK (0xFFFU)
#define XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_2M_SHIFT (0U)
/*! MAG_THRESH_2M - For 2Mbps data rate, the lowest signal level below which synchronization is
 *    considered unreliable and hence disallowed; uses ufix12_En24 fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_2M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_2M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_2M_MASK)
#define XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_HI_2M_MASK (0xFFF0000U)
#define XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_HI_2M_SHIFT (16U)
/*! MAG_THRESH_HI_2M - For 2Mbps data rate, the lowest signal level above which hamming-distance is
 *    always checked during AA detection; uses ufix12_En24 fixed-point format.
 */
#define XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_HI_2M(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_HI_2M_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_CFG3_MAG_THRESH_HI_2M_MASK)
/*! @} */

